In [2]:
import pandas as pd
import numpy as np

In [3]:
df=r'C:\Users\KDP-23\Desktop\KDT\pandas\datasets\bookings\Bookings.csv'

In [4]:
df=pd.read_csv(df)
df

,Hotel_Name,Review,Total_Review,Rating,Location
0,Oakwood Residence Midtown East,Superb,28,9.1,Murray Hill
1,Murray Hill East Suites,Good,52,7.6,Murray Hill
2,The Herald 8 by LuxUrban,Good,"2,870",7.8,Manhattan
3,"The Cloud One New York-Downtown, by the Motel ...",Very good,975,8.3,Wall Street - Financial District
4,Pod Times Square,Very good,"13,951",8.1,Hell's Kitchen
...,...,...,...,...,...
520,Fantastic 3BR At Financial District,NaN,NaN,NaN,Wall Street - Financial District
521,3 Bedroom Apartment In Midtown East,NaN,NaN,NaN,Manhattan
522,2BD 1BA Apartment At Financial District,NaN,NaN,NaN,Wall Street - Financial District
523,2BD 1BA Apartment At Wall Street,NaN,NaN,NaN,Wall Street - Financial District
524,Two BD Apartment At Midtown East,NaN,NaN,NaN,Manhattan

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Hotel_Name    525 non-null    object
 1   Review        325 non-null    object
 2   Total_Review  325 non-null    object
 3   Rating        315 non-null    float64
 4   Location      525 non-null    object
dtypes: float64(1), object(4)
memory usage: 20.6+ KB

In [6]:
df.describe() # 왜 Rating만 나오지?? >> 나머지는 object type이라서

           Rating
count  315.000000
mean     7.883492
std      0.885183
min      1.000000
25%      7.500000
50%      8.000000
75%      8.400000
max     10.000000

In [7]:
df1=df.copy()
df1

,Hotel_Name,Review,Total_Review,Rating,Location
0,Oakwood Residence Midtown East,Superb,28,9.1,Murray Hill
1,Murray Hill East Suites,Good,52,7.6,Murray Hill
2,The Herald 8 by LuxUrban,Good,"2,870",7.8,Manhattan
3,"The Cloud One New York-Downtown, by the Motel ...",Very good,975,8.3,Wall Street - Financial District
4,Pod Times Square,Very good,"13,951",8.1,Hell's Kitchen
...,...,...,...,...,...
520,Fantastic 3BR At Financial District,NaN,NaN,NaN,Wall Street - Financial District
521,3 Bedroom Apartment In Midtown East,NaN,NaN,NaN,Manhattan
522,2BD 1BA Apartment At Financial District,NaN,NaN,NaN,Wall Street - Financial District
523,2BD 1BA Apartment At Wall Street,NaN,NaN,NaN,Wall Street - Financial District
524,Two BD Apartment At Midtown East,NaN,NaN,NaN,Manhattan

In [8]:
df1.describe(include='object') # include='object'를 하면 데이터의 총 개수와 고유값의 개수(중복 제외라고 생각하면 될듯 ), 최빈값, 최빈값의 빈도수 가 추출

,Hotel_Name,Review,Total_Review,Location
count,525,325,325,525
unique,498,8,255,25
top,Hilton Garden Inn New York Central Park South-...,Very good,1 review,Manhattan
freq,2,117,5,112

In [9]:
df1['Review'].value_counts()

Review
Very good         117
Good              116
Review score       31
Fabulous           30
Superb             16
Superb 9.0          8
Exceptional         5
Exceptional 10      2
Name: count, dtype: int64

In [10]:
df1.loc[df['Review']=='Superb 9.0','Review']='Superb '
df1.loc[df['Review']=='Exceptional 10','Review']='Exceptional '

In [11]:
df1['Review'].value_counts()

Review
Very good        117
Good             116
Review score      31
Fabulous          30
Superb            24
Exceptional        7
Name: count, dtype: int64

In [12]:
# 책에는 위 내용처럼 있지만~~~~~~~~~~~~~~~
review_i=df['Review'].value_counts().index # 'Review'의 컬럼을 인덱스로 저장 후

In [13]:
df['Review'].value_counts()

Review
Very good         117
Good              116
Review score       31
Fabulous           30
Superb             16
Superb 9.0          8
Exceptional         5
Exceptional 10      2
Name: count, dtype: int64

In [14]:
review_i # 그럼 review_i에 아래의 값으로 저장 되있다.

Index(['Very good ', 'Good ', 'Review score ', 'Fabulous ', 'Superb ',
       'Superb 9.0', 'Exceptional ', 'Exceptional 10'],
      dtype='object', name='Review')

In [15]:
df.loc[df['Review']=='Superb 9.0','Review']=review_i[4]
df.loc[df['Review']=='Exceptional 10','Review']=review_i[6] # review_i의 인덱스로 집어 넣을 수 있다

In [16]:
df['Review'].value_counts()

Review
Very good        117
Good             116
Review score      31
Fabulous          30
Superb            24
Exceptional        7
Name: count, dtype: int64

In [17]:
df['Total_Review'].unique()

array(['28', '52', '2,870', '975', '13,951', '8,044', '16,148', '343',
       '6,038', '2,028', '9,659', '4,435', '7,298', '11,455', '2,802',
       '1,847', '2,189', '703', '1,382', '4,646', '951', '4,498', '1,475',
       '6,245', '5,866', '959', '1,876', '848', '3,097', '3,477', '1,648',
       '46', '2,289', '148', '664', '1,867', '1,067', '130', '920',
       '2,560', '3,878', '1,698', '719', '7,585', '1,180', '2,035',
       '6,144', '638', '9,240', '3,907', '3,128', '2,383', '833', '558',
       '3,170', '2,857', '981', '192', '1,449', '1,373', '598', '3,859',
       '3,639', '1,048', '2,859', '2,412', '749', '6,639', '1,143',
       '2,353', '3,002', '8,844', '57', '657', '2,535', '946', '1,087',
       '3,627', '844', '483', '1,078', '1,074', '1,797', '728', '415',
       '766', '523', '770', '178', '464', '647', '1,225', '562',
       '1 review', '1,188', '1,260', '4,246', '2,521', '586', '1,643',
       '1,243', '2,623', '621', '488', '607', '1,425', '1,389', '2,014',
       '1,000', '2,299', '595', '751', '159', '1,550', '1,030', '4,166',
       '1,089', nan, '663', '579', '1,864', '377', '832', '718', '1,294',
       '3,255', '495', '1,736', '1,918', '333', '234', '114', '2,620',
       '754', '1,105', '94', '1,097', '2,446', '665', '1,169', '2,717',
       '988', '1,046', '321', '317', '108', '76', '721', '1,420', '1,519',
       '49', '407', '193', '4,092', '965', '307', '2,317', '2,982',
       '3,832', '269', '1,834', '707', '425', '390', '985', '693',
       '1,218', '113', '1,122', '966', '711', '1,220', '13', '2,533',
       '233', '14', '553', '601', '532', '65 external  ', '1,592', '855',
       '400', '386', '1,092', '259', '411', '865', '3,471', '723', '525',
       '943', '1,500', '325', '1,708', '230', '227', '1,778', '53',
       '4,288', '787', '355', '1,251', '128', '258', '125', '699', '285',
       '109', '30', '1,754', '437', '60', '200', '2', '453', '769', '465',
       '6', '524', '434', '372', '817', '472', '314', '168', '1,085',
       '1,195', '1,118', '1,471', '416', '173', '352', '385', '1,482',
       '22 external  ', '241', '497', '117', '59', '79', '3',
       '3 external  ', '379', '42', '255', '99', '212', '602', '9', '165',
       '146', '14 external  ', '13 external  ', '7 external  ',
       '4 external  '], dtype=object)

In [18]:
df['Total_Review']=df['Total_Review'].map(lambda x:str(x).replace('external','').strip())
df['Total_Review']=df['Total_Review'].map(lambda x:str(x).replace('review','').strip())
df['Total_Review']=df['Total_Review'].map(lambda x:str(x).replace(',',''))
df['Total_Review']=df['Total_Review'].astype('float')

df['Total_Review'].describe()

count      325.000000
mean      1771.630769
std       2530.013514
min          1.000000
25%        343.000000
50%        920.000000
75%       2189.000000
max      16148.000000
Name: Total_Review, dtype: float64

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Hotel_Name    525 non-null    object
 1   Review        325 non-null    object
 2   Total_Review  325 non-null    float64
 3   Rating        315 non-null    float64
 4   Location      525 non-null    object
dtypes: float64(2), object(3)
memory usage: 20.6+ KB

In [20]:
index=df[df['Rating'].isna()].head().index

In [21]:
index

Index([167, 168, 169, 170, 171], dtype='int64')

In [22]:
row = df.iloc[[167,168,169,170,171]]
row

,Hotel_Name,Review,Total_Review,Rating,Location
167,Midtown E 2BR w WD nr Central Park NYC-531,Very good,NaN,NaN,Midtown East
168,Hotel Indigo Lower East Side New York,Fabulous,NaN,NaN,Lower East Side
169,UWS 1BR w Gym Walk to Central Park NYC-165,Very good,NaN,NaN,New York
170,The FIDI Hotel,Good,NaN,NaN,Wall Street - Financial District
171,The Frederick Hotel Tribeca,Fabulous,NaN,NaN,Tribeca

In [23]:
df['Rating'] = df['Rating'].fillna(df['Rating'].mean())

In [24]:
df.loc[index, 'Rating']

167    7.883492
168    7.883492
169    7.883492
170    7.883492
171    7.883492
Name: Rating, dtype: float64

In [25]:
s= pd.Series([1, np.nan,np.nan,2,np.nan,3])
s

0    1.0
1    NaN
2    NaN
3    2.0
4    NaN
5    3.0
dtype: float64

In [26]:
s.fillna(method='ffill') # ffill >>> front fill

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_15396\4230639994.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill') # ffill >>> front fill

0    1.0
1    1.0
2    1.0
3    2.0
4    2.0
5    3.0
dtype: float64

In [27]:
s.fillna(method='bfill') # bfill >>> back fill

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_15396\3469319776.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill') # bfill >>> back fill

0    1.0
1    2.0
2    2.0
3    2.0
4    3.0
5    3.0
dtype: float64

In [28]:
df1= df1.dropna()
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 307 entries, 0 to 333
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Hotel_Name    307 non-null    object
 1   Review        307 non-null    object
 2   Total_Review  307 non-null    object
 3   Rating        307 non-null    float64
 4   Location      307 non-null    object
dtypes: float64(1), object(4)
memory usage: 14.4+ KB

In [29]:
quantile=[0, 0.2, 0.4, 0.6, 0.8, 1]
for idx in quantile:
    q=df['Total_Review'].quantile(idx, interpolation='lower')
    print(f'quantile({idx}) is {q}')

quantile(0) is 1.0
quantile(0.2) is 227.0
quantile(0.4) is 657.0
quantile(0.6) is 1169.0
quantile(0.8) is 2620.0
quantile(1) is 16148.0

In [30]:
for idx in quantile:
    q=df['Total_Review'].quantile(idx, interpolation='nearest')
    print(f'quantile({idx}) is {q}')

quantile(0) is 1.0
quantile(0.2) is 230.0
quantile(0.4) is 663.0
quantile(0.6) is 1169.0
quantile(0.8) is 2620.0
quantile(1) is 16148.0